Revit 2024 API
ParameterTypeId.DimStyleLinearUnits Property
 "Units Format"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DimStyleLinearUnits { get; }
Visual Basic
Public Shared ReadOnly Property DimStyleLinearUnits As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DimStyleLinearUnits {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace